
####### p5.py ########
def mat_positive(X):
    """
    행렬 X의 각 요소를 0과 비교하여 더 큰 값을 출력하도록 한다.
    예를들면, a = [[ 0.6313, -1.0161, -0.9671,  1.3792],
      [-0.3768,  0.5337, -0.2665,  0.8579],
      [ 0.3222,  0.5991, -1.6419, -1.0042],
      [-1.0146, -0.3274,  0.3953,  0.3471]] 일 때,
    
    max_positive(a)는 [[0.6313, 0.0000, 0.0000, 1.3792],
      [0.0000, 0.5337, 0.0000, 0.8579],
      [0.3222, 0.5991, 0.0000, 0.0000],
      [0.0000, 0.0000, 0.3953, 0.3471]]을 return한다.
    """
    column_num = len(X)
    row_num = len(X[0])

    for i in range(column_num):
        for j in range(row_num):
            if X[i][j] < 0:
                X[i][j] = 0
    return X
