
####### p7.py ########
def mat_pointwise_mul(X, Y):
    """
    두 행렬 X, Y가 주어질 때, 각 요소의 곱을 출력하는 행렬을 return 하도록 한다.
    에를들면, 

    X = [[0.03675048, 0.07706246, 0.69890549],
       [0.04466621, 0.92735904, 0.79369379],
       [0.66768943, 0.69086682, 0.46034004]]

    Y = [[0.36456877, 0.90607237, 0.62344559],
       [0.75727173, 0.17691591, 0.81012876],
       [0.48280094, 0.94684034, 0.16939453]]
       이면,
    
    mat_pointwise_mul(X, Y) = 
        [[0.01339808, 0.06982417, 0.43572954],
       [0.03382446, 0.16406457, 0.64299417],
       [0.32236108, 0.65414057, 0.07797909]]
    을 return 한다.
    """
    column_num = len(X)
    row_num = len(X[0])
    ans = []

    for i in range(column_num):
        tmp=[]
        for j in range(row_num):
            tmp.append(X[i][j]*Y[i][j])
        ans.append(tmp)
    return ans
